VDowbensky/efr32_baremetal/baremetal_test/radio/src/rail_rf_hal.c
#include "rail.h"
#include "rail_rf_hal.h"
#include <stdbool.h>
#include <stddef.h>
#include "em_bus.h"
#include "em_int.h"
#include "em_assert.h"
#include "rail_rf_hal.h"
#include "rf_test.h"
//#include "ir_cal.h"
#include "generic_phy.h"
#include "protimer.h"
//#include "tempcal.h"
//#include "rfsense.h"
#include "pa.h"
#include "radio.h"
//#include "radio_pti.h"
#include "synth.h"
//#include "rail_calibration.h"

void pktTxDoneEvt(uint32_t param_1,RAIL_TxPacketInfo_t param_2,uint32_t param_3)

{
	RAIL_TxPacketInfo_t local_c;
	uint32_t uStack8;
  
  local_c = param_2;
  uStack8 = param_3;
  GENERIC_PHY_PreviousTxTime();
  local_c.timeUs = PROTIMER_PrecntOverflowToUs(GENERIC_PHY_PreviousTxTime());
  RAILCb_TxPacketSent(&local_c);
}



void pktRxOverflow(void)

{
  RAILCb_RxRadioStatus(0x20);
}



void preambleDetected(void)

{
  RAILCb_RxRadioStatus(2);
}



void frameDet0(void)

{
  RAILCb_RxRadioStatus(4);
}



void sequencerInterrupt(int param_1)

{
  if(param_1 & 0x00100000) RAILCb_RxRadioStatus(0x40);
}



//void RAIL_RFSENSE_Callback(void)

//{
//  RAILCb_RxRadioStatus(0x80);
//}



void pktTxErrorEvt(void)

{
  RAILCb_TxRadioStatus(2);
}



void racStateChange(void)

{
  RAILCb_RadioStateChanged((RAC->STATUS << 4) >> 0x1c);
}



void softwareTimerExpired(void)

{
//  timerExpired = 1; //!!!!!!!!!!!!!!!!!!!!
  GENERIC_PHY_TimerStop();
  RAILCb_TimerExpired();
}



void racCalRequest(void)

{
  //RAIL_RfHalCalibrationPend(1);
}





void protmrLbtEvt(int param_1)

{
  uint32_t uVar1;
  
  PROTIMER_CCTimerStop(4);
  if(param_1 & 0x00400000)
  {
    //RADIO_PTI_AuxdataOutput(0x27);
    GENERIC_PHY_FlushTxPacketBuffer();
    if ((SEQ->REG000 & 0xff000000) == 0x2000000)
    {
  //    _DAT_43080004 = 1; //FRC status - ??? !!!!!!!!!!!!!!!
    }
LAB_000100fc:
    RAILCb_TxRadioStatus(4);
    return;
  }
  //if (param_1 << 0xb < 0)
	  if(param_1 & 0x00100000)
  {
    //RADIO_PTI_AuxdataOutput(0x28);
    return;
  }
  //if (param_1 << 0x13 < 0)
	  if(param_1 & 0x00001000)
  {
    PROTIMER_LBTStop();
    if ((PROTIMER->IF & 0x500000) == 0)
    {
      //RADIO_PTI_AuxdataOutput(0x2a);
      GENERIC_PHY_FlushTxPacketBuffer();
      goto LAB_000100fc;
    }
  }
  return;
}





void pktRxDoneEvt(void)

{
  int iVar1;
  int iVar2;
  void * uVar3;
  uint32_t uVar4;
  int iVar5;
  uint32_t *puVar6;
  uint32_t uVar7;
  uint32_t uVar8;
  uint32_t uVar9;
  uint32_t local_38;
  uint32_t auStack52 [5];
  uint32_t local_2f;
  uint8_t local_2e;
  uint32_t local_28;
  
  iVar1 = RADIO_RxTrailDataLength();
//  iVar2 = RADIO_RxLengthReadNext(); //@!!!!!!!!!!!!!!
  if (iVar2 != 0xffff)
  {
    uVar9 = iVar2 - iVar1 & 0xffff;
    uVar3 = RAILCb_AllocateMemory(uVar9 + 0xc);
    uVar8 = 0;
    while (uVar8 < uVar9)
    {
      iVar2 = uVar8 + 10;
      local_38 = uVar9 - uVar8;
      RAILCb_BeginWriteMemory((void*)uVar3,iVar2,&local_38);
			//void *RAILCb_BeginWriteMemory(void *handle,uint32_t offset,uint32_t *available);
      if (local_38 == 0)
      {
        uVar4 = local_38;
        local_38 = uVar9 - uVar8;
      }
      iVar5 = GENERIC_PHY_PacketRxDataHelper(uVar4,local_38 & 0xffff);
      uVar8 = uVar8 + iVar5;
      if (uVar4 == 0)
      {
        iVar5 = 0;
      }
      uVar8 = uVar8 & 0xffff;
      RAILCb_EndWriteMemory((void*)uVar3,iVar2,iVar5);
    }
    GENERIC_PHY_PacketRxAppendedInfoHelper(iVar1,auStack52);
    local_38 = 0xc;
    puVar6 = (uint32_t *)RAILCb_BeginWriteMemory((void*)uVar3,0,&local_38);
    if ((puVar6 == NULL) || (local_38 < 0xc))
    {
      uVar7 = 0;
    }
    else
    {
      *(int16_t *)(puVar6 + 2) = (short)uVar9;
//      FRC->IEN._0_1_;
      uVar8 = FRC->IF;
      *(uint8_t *)(puVar6 + 1) = *(uint8_t *)(puVar6 + 1) & 0xfd | (uint8_t)((((uVar8 ^ 0x80) << 0x18) >> 0x1f) << 1);
      //_DAT_43000d1c = 1; //FRC 0068 bit 7
      FRC->IFC |= 0x80; //BLOCKERROR
      if (local_2e != 0)
      {
        local_2e = 1;
      }
      *(uint8_t *)(puVar6 + 1) = *(uint8_t *)(puVar6 + 1) & 0xfe | local_2e & 1;
      *(uint8_t *)((int)puVar6 + 5) = local_2f;
      *(uint8_t *)((int)puVar6 + 6) = 0;
      uVar7 = PROTIMER_PrecntOverflowToUs(local_28);
      *(uint8_t *)((int)puVar6 + 7) = 0;
      *puVar6 = uVar7;
      uVar7 = 0xc;
    }
    RAILCb_EndWriteMemory((void*)uVar3,0,uVar7);
    RAILCb_RxPacketReceived((void*)uVar3);
    RAILCb_FreeMemory((void*)uVar3);
  }
}





void pktRxFrmErr(void)

{
	BUS_RegMaskedSet(&FRC->IFC, FRC_IFC_BLOCKERROR_Msk);
  RAILCb_RxRadioStatus(0x10);
}




//typedef struct RAIL_Init {
//  uint16_t maxPacketLength; /**< The maximum number of bytes in a packet. UNUSED! */
//  const uint32_t rfXtalFreq; /**< The xtal frequency of the radio. */
//  RAIL_CalMask_t calEnable; /**< Mask that defines calibrations to perform in RAIL. */
//} RAIL_Init_t;
uint8_t RAIL_RfHalInit(const RAIL_Init_t *railInit)

{
  int iVar1;
  
  iVar1 = SystemHFXOClockGet();
  if (iVar1 != *(int *)(railInit + 4)) return 1;
  GENERIC_PHY_Init();
  //_enabledCallbacks = _enabledCallbacks & 0xff000000 | (uint)(uint3)((uint3)_enabledCallbacks | 7) | 0x80000;
	_enabledCallbacks = _enabledCallbacks & 0xff000000 | (uint32_t) (_enabledCallbacks | 7) | 0x80000;
  //iVar1 = RAIL_RfHalCalibrationEnableGet();
  //if (iVar1 << 0x1f < 0) _enabledCallbacks = _enabledCallbacks | 0x10000;
//  GENERIC_PHY_SetCallbacks(&_enabledCallbacks);
//  GENERIC_PHY_ConfigureCallbacks(_enabledCallbacks);
  RAILCb_RfReady();
  return 0;
}



void RAIL_RfHalIdleStart(void)

{
  GENERIC_PHY_RadioEnable(0);
}

//typedef enum RAIL_RadioState {
//  RAIL_RF_STATE_IDLE,
//  RAIL_RF_STATE_RX,
//  RAIL_RF_STATE_TX,
//} RAIL_RadioState_t;

//typedef enum RAIL_Status {
//  RAIL_STATUS_NO_ERROR,
//  RAIL_STATUS_INVALID_PARAMETER,
//  RAIL_STATUS_INVALID_STATE,
//} RAIL_Status_t;

RAIL_RadioState_t RAIL_RfHalStateGet(void)

{
  uint32_t state;
  bool bVar2;
  
  //uVar1 = RAC->STATUS;
  //uVar1 = uVar1 & 0xf000000;
  state = RAC->STATUS & 0xf000000;
  if (state != 0x6000000) 
		{
    if (0x6000000 < state) 
		{
      if (state != 0x9000000) 
			{
        if (state < 0x9000001) 
				{
          if (state == 0x7000000) return RAIL_RF_STATE_RX; //1
          bVar2 = state == 0x8000000;
        }
        else 
				{
          if (state == 0xb000000) return RAIL_RF_STATE_TX;
          if (state == 0xc000000) return RAIL_RF_STATE_TX;
          bVar2 = state == 0xa000000;
        }
        if (!bVar2) return RAIL_RF_STATE_IDLE;
        return RAIL_RF_STATE_TX;
    }
    if (state != 0x3000000) 
		{
      if (state < 0x3000001) 
			{
        if (state == 0x1000000) return RAIL_RF_STATE_RX;
        bVar2 = state == 0x2000000;
      }
      else 
			{
        if (state == 0x4000000) return RAIL_RF_STATE_RX;
        bVar2 = state == 0x5000000;
      }
      if (!bVar2) return RAIL_RF_STATE_IDLE;
    }
  }
  return RAIL_RF_STATE_RX;
	}
	return RAIL_RF_STATE_RX; //?????
	}



int RFHAL_HeadedToIdle(void)

{
  int iVar1;
  uint32_t uVar2;
  bool bVar3;
  
