VDowbensky/efr32_baremetal/baremetal_test/radio/src/rail_rf_hal.c
  INT_Disable();
  iVar1 = PROTIMER_CCTimerIsEnabled(3);
  //if ((iVar1 == 0) && (iVar1 = PROTIMER_LBTIsActive(), iVar1 == 0))
  if ((PROTIMER_CCTimerIsEnabled(3) == 0) && (PROTIMER_LBTIsActive() == 0))
  {
    uVar2 = RAC->STATUS;
    INT_Enable();
    if (((uVar2 & 0xc0000000) == 0) && (uVar2 = uVar2 & 0xf000000, uVar2 != 0x6000000))
    {
      if (uVar2 < 0x6000001) bVar3 = uVar2 == 0x3000000;
      else 
			{
        if (uVar2 == 0x9000000) return 0;
        bVar3 = uVar2 == 0xc000000;
      }
      if (!bVar3) iVar1 = 1;
    }
  }
  else
  {
    INT_Enable();
    iVar1 = 0;
  }
  return iVar1;
}



//typedef struct RAIL_TxData {
//  uint8_t *dataPtr; /**< Pointer to data to transmit */
//  uint16_t dataLength; /**< Number of bytes to load into transmit buffer */
//} RAIL_TxData_t;
uint8_t RAIL_RfHalTxDataLoad(RAIL_TxData_t *txData)

{
  uint8_t *local_10;
  uint32_t local_c;
  uint32_t uStack8;
  
//  local_10 = ((uint16_t)*txData & 0xffff0000) | (uint16_t)txData[1]; //(uint)*(uint16_t *)(param_1 + 1);
//  local_c = *txData;
//  uStack8 = txData[2];
  GENERIC_PHY_LoadTxPacketBuffer(local_10); //buffer address - ???
  return 0;
}





//undefined4 RAIL_CcaCsma(uint16_t *param_1,undefined4 param_2)
uint8_t RAIL_CcaCsma(void *params)
{
  uint8_t bVar1;
  int64_t lVar2;
  uint16_t uVar3;
  uint32_t uVar4;
  uint32_t uVar5;
  int iVar6;
  uint32_t uVar7;
  uint32_t uVar8;
  uint32_t uVar9;
  uint32_t uVar10;
  int iVar11;
  uint8_t bVar12;
  uint8_t bVar13;
  uint8_t bVar14;
  uint8_t bVar15;
  PROTIMER_Typedef *pPVar16;
  
//  if (param_1 != NULL)
//  {
//    uVar3 = param_1[3];
//    uVar9 = MODEM->CF;
//    uVar5 = MODEM->RXBR;
//    bVar13 = *(uint8_t *)((int)param_1 + 3);
//
//    uVar4 = (uVar5 << 0x16) >> 0x1b;
//    uVar8 = (uint32_t)*(uint8_t *)((int)&modemCfDec0Factors_8287 + (uVar9 & 7));
//    iVar11 = (((uVar9 << 0xf) >> 0x12) * uVar8 + uVar8) * 2000000;
//    uVar8 = CMU_ClockFreqGet(0x11,2000000,&modemCfDec0Factors_8287,iVar11,param_1,param_2);

 //   lVar2 = (uint64_t)uVar4 * (uint64_t)uVar3 * (uint64_t)uVar8;
 //   uVar5 = __aeabi_uldivmod((int)lVar2,(int)((uint64_t)lVar2 >> 0x20),
 //                            (uVar4 * ((uVar5 << 0x13) >> 0x1d) + (uVar5 & 0x1f)) *
 //                          (((uVar9 << 9) >> 0x1a) * iVar11 + iVar11),0);
 //   uVar9 = 0;
//    while ((uint32_t)(1 << (uVar9 & 0xff)) < uVar5)
//    {
//      if (uVar9 == 0x10) {
//        return 1;
//      }
//      uVar9 = uVar9 + 1;
//    }
//    //uVar5 = read_volatile_4(AGC->CTRL1);
//    AGC->CTRL1 &= 0xfffff000;
//    AGC->CTRL1 |= bVar13 | uVar9 << 8;
//    bVar13 = *(uint8_t *)(param_1 + 1);
//
//    bVar1 = *(uint8_t *)param_1;
//
//    bVar12 = *(uint8_t *)((int)param_1 + 1);
//
//    bVar14 = bVar13;
//    bVar15 = bVar13;
//    if ((bVar13 != 0) && (bVar13 = bVar13 - 1, bVar14 = 1, bVar15 = bVar1, bVar12 < bVar1))
//    {
//      bVar12 = bVar1;
//    }
//    uVar9 = count_leading_zeroes((uint)*param_1);
//
//    pPVar16 = (PROTIMER *)0x10421;
//    uVar3 = PROTIMER_UsToPrecntOverflow(param_1[2]);
//
//    uVar5 = (uint32_t)uVar3;
//    if (uVar9 >> 5 == 0)
//    {
//      uVar4 = (uint32_t)reseedRandom_8301;
//
//      if (uVar4 != 0xf804)
//      {
//        pPVar16 = &PROTIMER;
//      }
//      if (uVar4 != 0xf804)
//      {
//        pPVar16->RANDOM = uVar4;
//        reseedRandom_8301 = 0xf804;
//      }
//    }
//    else
//    {
//      uVar8 = 0;
//      uVar4 = uVar5;
//      while( true )
//      {
//        uVar10 = uVar8 & 0xff;
//        uVar8 = uVar8 + 1;
//        if (uVar4 < 0x100) break;
//        uVar4 = uVar4 >> 1;
//      }
//      if ((uVar10 != 0) && (uVar4 != 0xff))
//      {
//        uVar4 = uVar4 + ((int)uVar5 >> (uVar10 - 1 & 0xff) & 1U) & 0xffff;
//      }
//      uVar5 = PROTIMER->RANDOM;
//      reseedRandom_8301 = (ushort)(uVar5 & 0xffff);
//      if ((uVar5 & 0xffff) == 0xf804)
//      {
//        reseedRandom_8301 = 0xf805;
//      }
//      PROTIMER->RANDOM = (1 << uVar10) - 1;
//      bVar12 = 8;
//      PROTIMER->LBTSTATE = 0x800000;
//      bVar15 = 8;
//      uVar5 = uVar4;
//    }
//    PROTIMER->BASECNTTOP = uVar5;
//    PROTIMER_LBTCfgSet(bVar15,bVar12,bVar14,bVar13,0);
//    if (uVar9 >> 5 != 0)
//    {
//      _DAT_430a09d0 = 1;
//      //uVar5 = read_volatile_4(PROTIMER->CTRL);
//      //write_volatile_4(PROTIMER->CTRL,uVar5 & 0xff3fffff | 0x400000);
//	  PROTIMER->CTRL &= 0xff3fffff;
//	  PROTIMER->CTRL |= 0x400000;
//    }
//    lbtTimeout_8300 = *(int *)(param_1 + 4);
//  }
//  GENERIC_PHY_PacketTxCommon();
//  iVar11 = lbtTimeout_8300;
//  if (lbtTimeout_8300 != 0)
//  {
//    iVar6 = PROTIMER_CCTimerIsEnabled(4);
//    if (iVar6 != 0)
//    {
//      PROTIMER_CCTimerStop(4);
//    }
//    uVar7 = PROTIMER_UsToPrecntOverflow(iVar11);
//    iVar11 = PROTIMER_CCTimerStart(4,uVar7,1);
//    if (iVar11 == 0)
//    {
//      return 1;
//    }
//  }
//  PROTIMER_LBTStart();
  return 0;
}



// WARNING: Could not reconcile some variable overlaps

//void RAIL_CcaLbt(uint *param_1,uint param_2,uint param_3,uint param_4)
uint8_t RAIL_CcaLbt(void *params)
{
//  uint32_t uVar1;
//  uint8_t bVar2;
//  uint32_t local_14;
//  uint32_t local_10;
//  uint32_t uStack12;
//
//  local_14 = param_2;
//  local_10 = param_3;
//  uStack12 = param_4;
//  if ((param_1 != (uint32_t *)0x0) && (*(int16_t *)param_1 != 0)) {
//    local_14 = *param_1;
//    local_10._2_2_ = (uint16_t)(param_1[1] >> 0x10);
//    uStack12 = param_1[2];
//    bVar2 = *(byte *)param_1;
//    if (bVar2 != 0) {
//      local_10._2_2_ = *(short *)(param_1 + 1) * (ushort)bVar2 + local_10._2_2_;
//      local_14._1_1_ = (char)(local_14 >> 8);
//      local_14._2_2_ = (undefined2)(local_14 >> 0x10);
//      local_14 = (uint)CONCAT21(local_14._2_2_,local_14._1_1_ - bVar2) << 8;
//    }
//    uVar1 = local_14 >> 8 & 0xff;
//    bVar2 = 1;
//    while ((uint)(1 << (uint)bVar2) < uVar1) {
//      bVar2 = bVar2 + 1;
//    }
//    local_10 = uVar1 * *(ushort *)(param_1 + 1) + ((uint)(1 << (uint)bVar2) >> 1) >> (uint)bVar2 &
//               0xffff | (uint)local_10._2_2_ << 0x10;
//    local_14._0_2_ = CONCAT11(bVar2,bVar2);
//    local_14 = local_14 & 0xffff0000 | (uint)(ushort)local_14;
//    param_1 = &local_14;
//  }
//  RAIL_CcaCsma(param_1);
  return 0;
}



uint8_t RAIL_ScheduleTx(void *params)

{
  uint32_t uVar1;
  char cVar2;

  cVar2 = *(char *)(params + 1);
  if (cVar2 != '\0') 
	{
    cVar2 = '\x01';
  }
  //uVar1 = PROTIMER_UsToPrecntOverflow(*param_1);
//  GENERIC_PHY_SchedulePacketTx(PROTIMER_UsToPrecntOverflow(*params),cVar2);
  return 0;
}



