VDowbensky/efr32_baremetal/baremetal_test/radio/src/rail_rf_hal.c
//undefined4 RAIL_RfHalTxStart(undefined4 param_1,code *UNRECOVERED_JUMPTABLE,undefined4 param_3)
uint8_t RAIL_RfHalTxStart(uint8_t channel, RAIL_PreTxOp_t preTxOp, void *preTxOpParams)
{
  if (RAIL_DebugModeGet() != 1) 
  {
    do 
		{
      if (RFHAL_HeadedToIdle() == 0) break;
    } while ((RAC->STATUS & 0xf000000) != 0);
    if ((RAC->STATUS & 0xf000000) != 0) return 2;
    GENERIC_PHY_ChannelSet(channel);
  }
 // if (UNRECOVERED_JUMPTABLE != NULL)
 // {
                    // WARNING: Could not recover jumptable at 0x000105e8. Too many branches
                    // WARNING: Treating indirect jump as call
 //   uVar3 = (*UNRECOVERED_JUMPTABLE)(param_3);
 //   return uVar3;
 // }
  GENERIC_PHY_PacketTx();
  return 0;
}



uint8_t RAIL_RfHalRxStart(uint8_t channel)
{
  if ((RAC->RXENSRCEN & 0xff) == 0) RADIO_RxBufferReset();
  if (RAIL_DebugModeGet() != 1) 
	{
    do 
		{ 
      if (RFHAL_HeadedToIdle() == 0) break;
    } while ((RAC->STATUS & 0xf000000) != 0);
    if ((RAC->STATUS & 0xf000000) != 0) return 2; 
    GENERIC_PHY_ChannelSet(channel);
  }
  GENERIC_PHY_StartRx(0);
  return 0;
}





uint8_t RAIL_RfHalRxIntEnable(uint8_t cbToEn)

{
//  _enabledCallbacks =
//       CONCAT12((uint8_t)(_enabledCallbacks >> 0x10) & 0xfd |
//                (uint8_t)(((uint)(cbToEn << 0x19) >> 0x1f) << 1),
//                CONCAT11(DAT_000108e1 & 0xf8 | (uint8_t)((uint)(cbToEn << 0x1e) >> 0x1f) |
//                         (uint8_t)(((uint)(cbToEn << 0x1d) >> 0x1f) << 1) |
//                         (uint8_t)(((uint)(cbToEn << 0x1c) >> 0x1f) << 2),
//                         enabledCallbacks & 0xe7 | (uint8_t)(((uint)(cbToEn << 0x1b) >> 0x1f) << 3) |
//                         (uint8_t)(((uint)(cbToEn << 0x1a) >> 0x1f) << 4)));
//  _enabledCallbacks = _enabledCallbacks & 0xff000000 | (uint)_enabledCallbacks;
//  GENERIC_PHY_ConfigureCallbacks(_enabledCallbacks);
  return 0;
}





RAIL_Status_t RAIL_RfHalErrorConfig(RAIL_RadioState_t errors)

{
  //_DAT_43000884 = errors & 1; //FRC044 bit 1
	if (errors) BUS_RegMaskedSet(&FRC->RXCTRL, FRC_RXCTRL_ACCEPTCRCERRORS_Msk);
  return RAIL_STATUS_NO_ERROR;
}



uint32_t RAIL_RfHalSetChannelConfig(int param_1)

{
  if (RAIL_DebugModeGet() != 1) SYNTH_Config(*(uint32_t *)(param_1 + 8),*(uint32_t *)(param_1 + 4));
  return 0;
}


/**
 * Set the PA capacitor tune value for transmit and receive
 *
 * @param[in] txPaCtuneValue PA Ctune value for TX mode
 * @param[in] rxPaCtuneValue PA Ctune value for RX mode
 *
 * @return returns RAIL_STATUS_NO_ERROR if successful
 *
 * Provides the ability to tune the impedance of the transmit
 * and receive modes by changing the amount of capacitance at
 * the PA output.
 */
RAIL_Status_t RAIL_PaCtuneSet(uint8_t txPaCtuneValue, uint8_t rxPaCtuneValue)

{
  PA_CTuneSet(txPaCtuneValue, rxPaCtuneValue);
  return 0;
}




/**
 * Set a timer via the RAIL timebase
 *
 * @param[in] time The time to delay for in the RAIL timebase.
 * @param[in] mode The timer mode can be relative to now or an absolute time.
 * @return Returns RAIL_STATUS_NO_ERROR on success and
 * RAIL_STATUS_INVALID_PARAMETER if the timer could not be scheduled.
 *
 * Configure a timer to fire after some period in the RAIL timebase. This timer
 * can be used to implement low level protocol features.
 */
RAIL_Status_t RAIL_TimerSet(uint32_t time, RAIL_TimeMode_t mode)

{
  RAIL_Status_t b;
  INT_Disable();
  _enabledCallbacks = _enabledCallbacks | 0x100000;
  GENERIC_PHY_ConfigureCallbacks(_enabledCallbacks);
//  timerExpired = 0; //!!!!!!
  if (mode != 0) mode = 1;
  b = GENERIC_PHY_TimerStart(PROTIMER_UsToPrecntOverflow(time),mode);
  INT_Enable();
  return b ^ 1;
}


/**
 * Return the absolute time that the RAIL timer is configured to fire at.
 *
 * @return The absolute time that this timer is set to go off at.
 *
 * This will give the absolute time regardless of the \ref RAIL_TimeMode_t that
 * was passed into \ref RAIL_TimerSet. The return value is undefined if the
 * timer was never set.
 */
uint32_t RAIL_TimerGet(void)

{
  return PROTIMER_PrecntOverflowToUs(GENERIC_PHY_TimerGetTimeout());
}




/**
 * Stop the currently scheduled RAIL timer.
 *
 * @return void
 *
 * Cancels the timer. If this is called before the timer fires, then
 * RAILCb_TimerExpired will never be called.
 */
void RAIL_TimerCancel(void)

{
  uint32_t extraout_r1;
  uint32_t in_r3;
  
  GENERIC_PHY_TimerStop();
  _enabledCallbacks = _enabledCallbacks & 0xffefffff;
  GENERIC_PHY_ConfigureCallbacks(_enabledCallbacks);
}


/**
 * Check to see if the RAIL timer has expired
 *
 * @return True if the previously scheduled timer has fired and false otherwise.
 *
 * This is cleared on RAIL_TimerSet() and will be set when the delay expires.
 * This function can be used as an alternative to RAILCb_TimerExpired using
 * polling. If this is the case, implement RAILCb_TimerExpired as a stub.
 */
bool RAIL_TimerExpired(void)

{
//  uint8_t bVar1;
//  int iVar2;
  
//  iVar2 = GENERIC_PHY_TimerExpired();
//  bVar1 = timerExpired;
//  if (GENERIC_PHY_TimerExpired() != 0) bVar1 = 1;
//  return bVar1 & 1;
	return (GENERIC_PHY_TimerExpired() != 0);
}


/**
 * See if the RAIL timer is currently running
 *
 * @return Returns true if the timer is running and false otherwise
 *
 * Will return false if the timer was never set or has expired.
 */
bool RAIL_TimerIsRunning(void)

{
  return GENERIC_PHY_TimerIsRunning();
}


/**
 * Return the symbol rate for the current PHY
 *
 * @return The symbol rate in symbols per second
 *
 * The symbol rate is the rate of symbol changes over the air. For non-DSSS
 * PHYs this is the same as the baudrate. For DSSS PHYs it is the baudrate
 * divided by the length of a chipping sequence. For more information on this
 * consult the modem calculator documentation.
 */
uint32_t RAIL_SymbolRateGet(void)

{
  return RADIO_ComputeTxSymbolRate();
}


/**
 * Return the bit rate for the current PHY
 *
 * @return The bit rate in bits per second
 *
 * The bit rate is the effective over the air data rate. It does not account
 * for extra spreading you may do for things like forward error correction, but
 * will account for modulation schemes, DSSS, and other configurations. For more
 * information on this consult the modem calculator documentation.
 */
uint32_t RAIL_BitRateGet(void)

{
  return RADIO_ComputeTxBitRate();
}



/**
 * Start/Stop RF Sense functionality for use during low-energy sleep modes.
 *
 * @param[in] band The frequency band(s) on which to sense RF energy.
 * To stop Rf Sense, specify \ref RAIL_RFSENSE_OFF.
 * @param[in] senseTime The time (in microseconds) RF energy must be
 * continually detected to be considered "sensed".
 * @param[in] enableCb Set true to enable \ref RAILCb_RxRadioStatus() callback
 * with status \ref RAIL_RX_CONFIG_RF_SENSED when Rf is sensed.  Set false if
 * prefer to poll via \ref RAIL_RfSensed().
 *
 * @return The actual senseTime utilized, which may be different than
 * requested due to limitations of the hardware.  If 0, RF sense was
 * disabled or it could not be enabled (no callback will be issued).
 *
 * The EFR32 has the ability to sense the presence of RF Energy above -20 dBm
 * within either or both the 2.4 GHz and Sub-GHz bands, and trigger an event
 * if that energy is continuously present for certain durations of time.
 *
 * @note After RF energy has been sensed, RF Sense is automatically disabled,
 * and RAIL_RfSense() must be called again to reactivate it.
 *
 * @warning RF Sense functionality is only guaranteed from 0 to
 *          85 degrees Celsius. RF Sense should be disabled
 *          outside this Temperature range.
 */
//uint32_t RAIL_RfSense(RAIL_RfSenseBand_t band, uint32_t senseTime, bool enableCb)

//{
 // code *local_14;
  //undefined4 local_10;
  //uint local_c;
  
