VDowbensky/efr32_baremetal/baremetal_test/radio/src/rail_rf_hal.c
//  local_14 = RAIL_RFSENSE_Callback;
//  if (enableCb == false)
//  {
//    local_14 = NULL;
//  }
  //local_c._0_2_ = CONCAT11(1,band);
  //local_c = param_4 & 0xffff0000 | (uint)(ushort)local_c;
  //local_10 = senseTime;
//  RFSENSE_Init(&local_14);
//  return 0;
//}


/**
 * Check if RF was sensed.
 *
 * @return true if RF was sensed since last call to \ref RAIL_RfSense; false
 * otherwise.
 *
 * This function is useful if \ref RAIL_RfSense has been called with enableCb
 * set to false. It is generally used after EM4 reboot, but can be used any
 * time.
 */
//bool RAIL_RfSensed(void)

//{
//  return RFSENSE_Sensed();
//}




/**
 * Configure Debug callbacks (all are optional)
 *
 * @param[in] cbToEnable Define statuses that force TxRadioStatus callback
 */
void RAIL_DebugCbConfig(uint32_t cbToEnable)

{
//  _enabledCallbacks =
//       CONCAT11(DAT_000108e1 & 0xef | (byte)(((uint)(param_1 << 0x1e) >> 0x1f) << 4),
//                enabledCallbacks);
//  _enabledCallbacks = _enabledCallbacks & 0xffff0000 | (uint)_enabledCallbacks;
//  GENERIC_PHY_ConfigureCallbacks(_enabledCallbacks);
  return;
}


/*
void RAIL_RfHalCalibrationRun(int *param_1,int param_2)

{
  int iVar1;
  
  if (param_2 << 0x1f < 0) {
    TEMPCAL_Perform();
  }
  if (param_2 << 0xf < 0) {
    if (*param_1 == -1) {
      iVar1 = IRCAL_Perform();
      *param_1 = iVar1;
      return;
    }
//    IRCAL_Set();
		IRCAL_Set(0); //!!!!!!!!!!!!!!!!!!!!!!
    return;
  }
  return;
}

*/



RAIL_Status_t RAIL_RfHalSetTxTransitions(RAIL_RadioState_t success,RAIL_RadioState_t error)

{
  SEQ->REG000 = 1 << (success + 0x10U & 0xff) | (uint32_t)SEQ->REG000 | 1 << (error + 0x18U & 0xff);
  return RAIL_STATUS_NO_ERROR;
	
//	  ushort uVar1;
  
//  uVar1 = read_volatile_2(Peripherals::SEQ.REG00C._0_2_);
//  write_volatile_4(Peripherals::SEQ.REG00C,1 << (success + 0x10 & 0xff) | (uint)uVar1 | 1 << (error + 0x18 & 0xff));
//  return RAIL_STATUS_NO_ERROR;
}





RAIL_Status_t RAIL_RfHalSetRxTransitions(RAIL_RadioState_t success,RAIL_RadioState_t error)

{
	SEQ->REG000 = 1 << (error + 8U & 0xff) | 1 << (success & 0xff) | SEQ->REG000 & 0xffff0000;
  return RAIL_STATUS_NO_ERROR;
}

void RFHAL_SetBerConfig(RAIL_BerConfig_t *config)
{
	RFTEST_ResetBerStats(config->bytesToTest);
}

void RFHAL_ResetBerStats(uint32_t bytes)

{
  RFTEST_ResetBerStats(bytes);
}



void RFHAL_StartBerRx(void)

{
  RFTEST_SaveRadioConfiguration();
  FRC->DFLCTRL = 5;
  MODEM->TIMING &= 0xfffff0ff;
  RADIO_RXBufferEnableThrInt();
  RFTEST_StartRx();
}



void RFHAL_StopBerRx(void)

{
  RFTEST_BerStop();
  RADIO_RXBufferDisableThrInt();
  RFTEST_RestoreRadioConfiguration();
}


/*
void RFHAL_GetBerStatus(RAIL_BerStatus_t *berstatus)

{
  uint32_t in_r1;
  uint32_t in_r2;
  int8_t in_r3;
  RAIL_BerStatus_t *local_18;
  uint32_t local_14;
  uint32_t local_10;
  int8_t local_c;
  
  local_18 = berstatus;
  local_14 = in_r1;
  local_10 = in_r2;
  local_c = in_r3;
  RFTEST_ReportBerStats(&local_18);
  berstatus->bitsTotal = (uint32_t)local_18;
  berstatus->bitsTested = local_14;
  berstatus->bitErrors = local_10;
  berstatus->rssi = local_c;
  return;
}
*/
//void RFHAL_GetBerStatus(int *param_1,int param_2,int param_3,undefined4 param_4)
void RFHAL_GetBerStatus (RAIL_BerStatus_t *status)
{
//  int local_18;
//  int local_14;
// int local_10;
//  undefined4 local_c;
  
//  local_18 = (int)param_1;
//  local_14 = param_2;
//  local_10 = param_3;
//  local_c = param_4;
  RFTEST_ReportBerStats(status);
//  *param_1 = local_18;
//  param_1[1] = local_14;
//  param_1[2] = local_10;
//  *(undefined *)(param_1 + 3) = (undefined)local_c;
}


